Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: འོན་ཀྱང་ལག་པ་རྐྱོང་ལ་ཀླུའི་དབང་པོ་བཟོད་པར་གསོལ་ལོ་ཞེས་སྨྲོས་ཤིག་དང་བཟོད་པར་འགྱུར་རོ།
en: “No, reach out your hand and say, ‘O nāga kings, forgive me,’ and you will be forgiven.”

source: །རྒྱལ་པོས་དེ་གཉིས་འོང་བ་ལ་འབད་དེ་སྡོད་ཅིང་འདུག་པ་དང་། ཇི་ཙམ་ན་དེ་གཉིས་ཁྱིམ་བདག་གི་ཆ་བྱད་དུ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འོངས་པ་དང་དེ་མ་ཐག་ཏུ་རྒྱལ་པོ་ཡང་འོངས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྟགས་བསྟན་པ་དང་རྒྱལ་པོས་ལག་པ་མངོན་དུ་བརྐྱང་ནས་སྨྲས་པ། ཀླུའི་དབང་པོ་གཉིས་བཟོད་པར་གསོལ་ལོ།
en: The king was sitting patiently when the two nāga kings arrived. Just as they both came dressed as householders into the presence of the Blessed One, the king also came. And when the Blessed One made a sign, the king reached out his hand and said, “O you two nāga kings, please forgive me.”

source: །རྒྱལ་པོ་ཆེན་པོ་བཟོད་པར་བགྱིའོ།
en: “Great King, you are forgiven.”

source: །གལ་ཏེ་བཟོད་པར་གྱུར་ན་ནི་འདིར་སྤྱོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ལས་བདག་ཅག་གིས་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བླངས་པས་དེ་ཉིད་ཀྱི་ཚེ་བདག་ཅག་གི་ལུས་དང་ལོངས་སྤྱོད་སྐྱེས་ཏེ།
en: “If I am forgiven, please return.” “Great King, since we sought refuge in the Blessed One and accepted the rules of training, our bodies and the amount of food we need for our bodies have increased.

source: གལ་ཏེ་ད་ཆེ་བཞིན་དུ་འདིར་འོངས་ན་ཡུལ་མ་ག་དྷཱར་ཡང་མི་ཤོང་བར་འགྱུར་རོ།
en: If we come here with our present body size, even the whole country of Magadha would not be able to accommodate us.”

source: །འོ་ན་ཡུལ་མ་ག་དྷཱ་མ་རུང་བར་འགྱུར་མོད།
en: “Then the country of Magadha will be ruined!”

source: མ་རུང་བར་མི་འགྱུར་རོ།
en: “It will not be ruined.”

source: །ཇི་ལྟར་མི་འགྱུར།
en: “Why will it not?”

source: ཁྱོད་ཀྱིས་ཁོ་བོ་ཅག་གི་ཁང་བཟངས་གཉིས་རྩིགས་ལ་ཟླ་བ་དྲུག་ཅིང་དུས་མཆོད་གྱིས་ཤིག་དང་། ཁོ་བོ་ཅག་གི་འཁོར་བཞག་ལ་དུས་མཆོད་ཀྱི་ཚེ་ཡང་འདུ་བར་བྱའོ།
en: “Have two palaces built for us and offer worship every six months, and we will make our attendants stay there and gather together at the time of worship.” The king did as he had been told.

source: །རྒྱལ་པོས་དེ་བཞིན་དུ་བྱས་པ་དང་། དེ་གཉིས་ཀྱིས་འཁོར་དག་ཀྱང་བཞག་ལ་དུས་མཆོད་ཀྱང་རང་ཉིད་ཉམས་སུ་མྱོང་བར་བྱེད་དོ།
en: The two nāga kings made their attendants stay there, and the nāga kings received his worship themselves. B. The Quarrel between the Brahmin Agnidatta and the Citizens of Rājagṛha

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་དེ་དག་གི་འཁོར་བག་མེད་པར་གནས་པ་ན་ཀླུ་གདུག་པ་དག་གིས་གླགས་རྙེད་ནས། དེ་དག་གིས་སེར་བ་དབབ་པར་བརྩམས་སོ།
en: Later, when their attendants were living in idleness, wicked nāgas took the opportunity to cause hail.

source: །རྒྱལ་པོའི་ཁབ་ན་བྲམ་ཟེ་སེར་བའི་སྔགས་ལ་མཁས་པ་གཞན་ཞིག་ཡོད་དེ།
en: In Rājagṛha, there was a brahmin who was familiar with a charm against hail, and he stopped the hail each time.

source: དེས་དེ་བབ་ཅིང་བབ་པ་དག་བཅད་པ་དང་། དེ་ལ་ཡུལ་མ་ག་དྷཱ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་དབང་ཐང་བྱིན་ནོ།
en: The people living in the country of Magadha gave him an allotment.

source: །ལྷོ་ཕྱོགས་ན་བྲམ་ཟེ་མེས་བྱིན་ཞེས་བྱ་བ་སེར་བའི་སྔགས་ལ་མཁས་པ་ཞིག་ཡོད་པ་དེས་བྱང་ཕྱོགས་ན་ཡུལ་ནུས་པ་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: There was another brahmin named Agnidatta in the southern region who was also familiar with a charm against hail.

source: དེ་ན་རྒྱལ་པོ་སྡེ་མཆོག་ཅེས་བྱ་བ་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ། །དེའི་ཡུལ་ན་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་ཀྱི་གནས་ཡོད་དེ།
en: He heard that there was a country in the northern region named Powerful over which a king named Best Army ruled, that there was the residence of a nāga king named Sundara in that country, and that there was a medicine that had great potency and surpassed any other medicine.

source: དེ་ན་སྨན་མཐུ་ཆེ་བ་ཕ་རོལ་གནོན་པ་ཡོད་པར་ཐོས་ནས་དེའི་ཆེད་དུ་འགྲོའོ་ཞེས་དེ་ཆས་ཏེ་རིམ་གྱིས་རྒྱལ་པོའི་ཁབ་ཏུ་ཕྱིན་ནས་བྲམ་ཟེ་སེར་བའི་སྔགས་འཆང་བ་དེའི་གནས་སུ་ཞུགས་པ་དང་། ཇི་ཙམ་ན་སེར་བ་ཆེན་པོ་བབ་པ་བྲམ་ཟེ་གཉུག་མར་གནས་པ་དེས་གཅད་པར་མ་ནུས་ནས་དེ་ཕྱིར་བྱུང་ནང་དུ་ཞུགས་བྱེད་པ་དང་བྲམ་ཟེ་མེས་བྱིན་གྱིས་དྲིས་པ།
en: He decided to go there in order to get the medicine. He departed and in due course he arrived at Rājagṛha, where he stayed in the residence of the first brahmin who had the charm against hail. Then, when it hailed a lot, the brahmin who had originally lived there was unable to stop the hail and, at a loss, was going in and out of the house again and again.

source: མཁན་པོ་ཅིའི་སླད་དུ་མཁན་པོ་འདི་ཕྱིར་བྱུང་ནང་དུ་ཞུགས་པར་མཛད།
en: The brahmin Agnidatta asked him, “Sir, why are you going in and out of the house again and again?”

source: དེས་སྨྲས་པ། བུ་སེར་བ་ཆེན་པོ་བབ་པ་གཅད་པར་མ་ནུས་པར་བས་མོད།
en: “Because I cannot stop the great hail, my son,” said the first brahmin.

source: བདག་གིས་དགུམ་མོ།
en: “I shall stop it.”

source: །བུ་ལེགས་སོ།
en: “That would be good, my son.”

source: །དེས་ཆུ་ཉུང་ཞིག་ལ་བཟླས་ཏེ་གཏོར་བས་ཚལ་པ་བརྒྱར་གྱེས་སོ།
en: Agnidatta placed a spell on some water and sprinkled the water, whereupon the cloud broke into a hundred pieces and dispersed.

source: །རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་མཆོག་ཏུ་ངོ་མཚར་དུ་གྱུར་ནས། རྔན་པ་ཐོགས་ཏེ་བྲམ་ཟེ་དེའི་ཁྱིམ་དུ་སོང་ནས་སྨྲས་པ།
en: The brahmins and householders in Rājagṛha were very surprised and went to the brahmin’s house, bringing gifts.

source: མཁན་པོ་རྒྱལ་པོའི་ཁབ་ཀྱི་སྐྱེ་བོའི་ཚོགས་མངོན་པར་དགའ་བར་གྱུར་གྱིས་རྔན་པ་ལོང་ཤིག །ཅིའི་ཕྱིར།
en: “Sir,” they said, “the people in Rājagṛha are rejoicing. Please accept our gifts.” “Why?”

source: ཁྱོད་ཀྱིས་སེར་བ་ཆེན་པོ་ཁུམས་པའི་སླད་དུའོ།
en: “Because you stopped the great hail.”

source: །དེས་སྨྲས་པ། ཁོ་བོས་ནི་མ་བཅད་དེ། འོན་ཀྱང་བྲམ་ཟེ་འདིས་བཅད་དོ།
en: “I did not stop the hail,” he told them, “this brahmin did.”

source: །དེ་དག་བྲམ་ཟེ་དེའི་དྲུང་དུ་དོང་ནས་བྲམ་ཟེའི་ཁྱེའུ་འདི་ཉིད་དུ་འདུག་ཤིག་དང་དབང་ཐང་སྦྱིན་ནོ།
en: They went to the brahmin Agnidatta and said, “O young brahmin, please remain here and we shall give you an allotment.”

source: །དེ་བཞིན་དུ་གནས་པར་བྱའོ་ཞེས་དེ་གནས་སོ།
en: “In that case, I shall live here.” So, he lived there.

source: །དེས་སེར་བ་དེ་དུས་ཐ་གི་ཙམ་ཞིག་གི་བར་དུ་སྔགས་ཀྱིས་བགགས་ཏེ་མི་འབབ་པར་གྱུར་ཏོ།
en: He stopped the hail with the charm and for a while it never hailed.

source: །རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་བདག་ཅག་ཉིད་ཀྱི་བསོད་ནམས་ཀྱིས་སེར་བ་མི་འབབ་ན་ཅིའི་ཕྱིར་དེ་ལ་དབང་ཐང་སྦྱིན་ཞེས་དེ་རྣམས་ཀྱིས་བཅད་དོ།
en: The brahmins and householders in Rājagṛha said to each other, “Sirs, since it does not hail thanks to our own merits, why should we give him an allotment?” They stopped giving the allotment.

source: །བྲམ་ཟེ་དེས་སྔགས་བརྟུལ་ནས་ཡུལ་ནུས་པ་ཅན་དུ་སོང་བ་དང་ཕྱིར་ཡང་སེར་བ་བབ་པར་གྱུར་ཏོ།
en: The brahmin Agnidatta then stopped using his charm and went to the country of Powerful, and later it started to hail again.

source: །དེ་རྣམས་བྲམ་ཟེ་དེའི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ། མཁན་པོ་བྲམ་ཟེའི་ཁྱེའུ་དེ་གར་མཆིས།
en: The people went to the brahmin who had originally lived there and asked him, “Sir, where is the young brahmin?”

source: དེས་སྨྲས་པ། ཁྱེད་ཅག་གིས་དེ་ལ་བཀུར་སྟི་མ་བྱས་པས་དེ་སོང་ངོ་།
en: He replied, “Since you did not treat him with respect, he has left.”

source: །མཁན་པོ་གལ་ཏེ་མཆིས་ན་བདག་ཅག་ལ་སྦྲོན་ཅིག །དེ་བཞིན་དུ་བྱའོ།
en: “Sir, if he comes back, please let us know.” “I shall do so.”

source: །དེ་ཡང་རིམ་གྱིས་རྒྱལ་པོ་སྡེ་མཆོག་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Agnidatta went in due course to King Best Army.

source: རྒྱལ་པོ་སྡེ་མཆོག་ལ་རྒྱལ་བ་དང་ཚེ་སྤེལ་བ་དག་བྱས་ནས་སྨྲས་པ། ལྷ་ཁྱོད་ཀྱི་ཡུལ་ན་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་ཞེས་བགྱི་བ་མཆིས་པ་དེའི་གནས་ན་མོད་ལ་མཐུ་སྐྱེད་པ་ཞེས་བགྱི་བའི་སྨན་མཆིས་ཀྱིས་ལྷ་དེ་སྟོན་ཅིག །ལྷའི་སྐལ་བ་ཡང་དབུལ་བར་བགྱིའོ།
en: Upon his arrival, he wished King Best Army victory and long life and said, “Your Majesty, there is a nāga king named Sundara in your land, and there is a medicine named immediate effect in his residence. Your Majesty, please tell me where he is, and I will offer you a portion of the medicine.”

source: །རྒྱལ་པོས་སྨྲས་པ། ཀྱེ་བྲམ་ཟེ་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་ནི་གཏུམ་པོ་ཡིན་པས་དེས་ཁྱོད་བརླག་པར་མི་བྱེད་གྲང་།
en: “O brahmin,” said the king, “since the nāga king Sundara is fierce, he will certainly defeat you.”

source: ལྷ་རེ་ཞིག་བདག་ལ་སྔགས་ཀྱི་མཐུ་དང་སྨན་གྱི་མཐུ་མཆིས་ཏེ།
en: “Your Majesty, for the time being I have the power of a charm and the power of medicine.

source: གལ་ཏེ་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་དང་འདྲ་བའི་ཀླུ་རྣམས་ཀྱིས་འཛམ་བུའི་གླིང་འདི་ལྟ་སྟེ། བུ་རམ་ཤིང་གི་ཚལ་ལམ། འདམ་བུའི་ཚལ་བཞིན་གང་བར་གྱུར་ཀྱང་བདག་གི་བ་སྤུ་གཅིག་ཀྱང་བསྐྱོད་པར་རྔོ་མི་ཐོག་ན་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: If the continent of Jambu were to be filled with nāgas like the nāga king Sundara as densely as a thicket of sugarcane or a thicket of reeds, a single hair of mine would not be moved by the nāgas, much less so by the nāga king Sundara alone.

source: འོན་ཀྱང་ལྷའི་མི་དགུམ་པ་ལ་ཐུག་པ་འགའ་མཆིས་སམ།
en: By the way, is there any citizen of Your Majesty who is to be executed?”

source: བྲམ་ཟེ་ཡོད་དོ།
en: “Yes, there is, brahmin.”

source: །ལྷ་དེ་བཀྲི་ཤིག་དང་དེས་དེའི་གནས་སྟོན་པར་འགྱུར་རོ།
en: “Your Majesty, please summon him here and make him tell me where the residence of the nāga king is.”

source: །དེ་ནས་རྒྱལ་པོས་མི་དེ་ལ་བོས་ཏེ་བསྒོ་བ། ཀྱེ་ནང་རྗེ་བྲམ་ཟེ་འདི་ལ་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་ཀྱི་གནས་སྟོན་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་མི་དེས་རྒྱལ་པོའི་ལྟར་མཉན་ནས་བྲམ་ཟེ་དེ་ཁྲིད་དེ་ཆས་སོ།
en: The king then summoned the man and ordered him, “Hey, tell this brahmin where the residence of the nāga king Sundara is.” “Certainly, Your Majesty,” replied the man to the king, and he departed, guiding the brahmin.

source: །ཇི་ཙམ་ན་མི་རིང་བ་ཞིག་ཏུ་བསྡད་ནས་དེ་ལ་སྨྲས་པ། བྲམ་ཟེ་ཚལ་སྔོ་ཞིང་སྔོ་བ་དག་བསྒྲེངས་པ་ཕ་བི་མཐོང་ངམ། མཐོང་ངོ་།
en: Then, after having traveled for some distance, the man halted and said to the brahmin, “Brahmin, do you see that green forest rising up over there?” “Yes, I do.”

source: །དེ་ནི་ཀླུའི་རྒྱལ་པོ་རབ་མཛེས་ཀྱི་གནས་ཡིན་ནོ།
en: “That is the residence of the nāga king Sundara.”

source: །དེ་སོང་སྟེ་དེས་དེར་མོད་ལ་མཐུ་སྐྱེད་པ་ཞེས་བྱ་བའི་སྨན་ལས་ཁུར་དུ་གྲགས་ནས། དེས་དེ་ཐོགས་ཏེ་ཡུལ་ནུས་པ་ཅན་དུ་སོང་ནས་རྒྱལ་པོ་སྡེ་མཆོག་གི་སྐལ་བ་བྱིན་ཏེ།
en: Agnidatta went there and bound the medicine called immediate effect in a bundle, brought it to the country of Powerful, and gave King Best Army his portion of the medicine.

source: རིམ་གྱིས་རྒྱལ་པོའི་ཁབ་ཏུ་ཕྱིན་ནས་བྲམ་ཟེ་དེ་ཉིད་ཀྱི་ཁྱིམ་དུ་ཞུགས་སོ།
en: He arrived in due course at Rājagṛha and stayed at the house of the original brahmin.

source: །དེ་ནས་དེས་རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་སྦྲན་པ་དང་། དེ་དག་མཆོད་ཡོན་ཐོགས་ཏེ་ལྷགས་ནས་བྲམ་ཟེའི་ཁྱེའུ་འདི་ཉིད་དུ་འདུག་ཤིག་དབང་ཐང་སྦྱིན་ནོ།
en: Then, when the brahmin had called together the brahmins and householders in Rājagṛha, they brought offerings and said, “O young brahmin, please remain here. We shall give you an allotment.”

source: །དེས་སྨྲས་པ། ཁྱེད་ཅག་གིས་བཀུར་སྟི་མ་བྱས་པས་ཁོ་བོ་མི་འདུག་གོ།
en: Agnidatta replied, “Since you did not treat me with respect, I will not remain.”

source: །དེ་རྣམས་ཀྱིས་དེ་གཞག་པར་གལ་གྱིས་གཅུ་བར་བརྩམས་ཏེ་གསོལ་བ་བཏབ་པ་དང་ཁས་བླངས་ནས་དེ་དག་གིས་འཚོ་བའི་རིས་བཅད་དོ།
en: They started to insist that he stay, entreated him, made a promise, and provided him with sustenance.

source: །འཇིག་རྟེན་ནི་ཕུན་སུམ་ཚོགས་པ་འདོད་ཀྱི་རྒུད་པ་དང་མི་མཐུན་པས། དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ། དེ་དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དོ། །དེ་རྩེ་བར་བྱེད་དགའ་བར་བྱེད།
en: Since people in the world desire prosperity and abhor decline, Agnidatta took a wife from a family of equal rank, and he and she played, made love, and enjoyed themselves.

source: དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ན་ཁྱེའུ་ཞིག་བཙས་ཏེ། དེས་དེའི་མིང་རི་བོ་ཅན་ཞེས་བྱ་བར་བཏགས་སོ།
en: Thus, a boy was born, and Agnidatta named his son Mountain.

source: །དེ་ཡང་རྩེ་བར་བྱེད་དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་པ་ན་བུ་མོ་ཞིག་བཙས་ཏེ། དེའི་མིང་ནི་སེར་བ་ཞེས་བྱ་བར་བཏགས་སོ།
en: When the couple again played, made love, and enjoyed themselves, a girl was born, and Agnidatta named his daughter Hail.

source: །བྲམ་ཟེ་མོ་ནི་འཁོར་བྲལ་ཞེས་བྱའོ།
en: The name of the brahmin’s wife was Free from the Cycle.

source: །མནའ་མ་ནི་གློག་ཅེས་བྱའོ། །དེས་བསམས་པ།
en: The name of his son’s wife was Lightning.

source: ཡང་དང་ཡང་དུ་སེར་བ་གཅོད་ཅིང་ཅི་ལས་མེད།
en: Agnidatta thought, “What is the use of my stopping the hail each and every time?

source: ཡུན་རིང་རབ་ཏུ་སྔགས་ཀྱིས་དགག་པར་བྱའོ་ཞེས་དེས་ཡུན་རིང་པོར་སྔགས་ཀྱིས་དགག་པ་བྱས་ཏེ་བཞག་པས་སེར་བ་མི་འབབ་པར་གྱུར་ཏོ།
en: I will use a charm to block it for a long time.” Because he used a charm to block the hail for a long time, it did not hail.

source: །རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་སྨྲས་པ། བདག་ཅག་ཁོ་ནའི་བསོད་ནམས་ཀྱི་མཐུས་སེར་བ་མི་འབབ་ན། ཅིའི་ཕྱིར་དབང་ཐང་སྦྱིན་ཞེས་དེ་རྣམས་ཀྱིས་བཅད་དོ།
en: The brahmins and householders in Rājagṛha said to each other, “Sirs, since it does not hail thanks to our own merits, why should we give him an allotment?” They stopped giving the allotment.

source: །བྲམ་ཟེ་དེ་ཕྲག་དོག་གི་ཟིལ་གྱིས་ནོན་པས་བུ་ཡང་སྔགས་ཀྱི་ཚིག་རྣམས་འཛིན་དུ་མ་བཅུག་གོ། །བདེ་བ་ལ་ཆགས་པས་ཁ་ཏོན་ཡང་མ་བྱས་ལ་སྨན་ཡང་སྐམ་དུ་མ་བཅུག་གོ། །དེས་སྔགས་ཀྱི་ཚིག་རྣམས་ནི་བསམས་ན་བརྗེད་སྨན་ནི་མ་བསྐམས་པས་རུལ་བར་གྱུར་ཏོ།
en: The brahmin, out of jealousy, had not taught the words of the charm even to his son, and, attached to his life of ease, he had neither recited the charm nor kept the medicine dry, whereupon he forgot the words of the charm and found the medicine rotten because it had not been dried.

source: །དེ་རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ལ་སྙིང་ན་ཆེས་ནས། དེ་རྣམས་ལ་ཀླན་ཀ་བཙལ་བའི་ཕྱིར་མུ་སྟེགས་ཀྱི་གནས་དང་དཀའ་ཐུབ་ཀྱི་ཚལ་དེ་དང་དེ་དག་ཏུ་སོང་ནས་དྲིས་པ། ཤེས་ལྡན་དག་གང་གིས་གང་བསམས་པ་དང་། གང་དོན་དུ་གཉེར་བ་དེ་ལ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་བའི་ཐབས་ལྟ་ཅི་ཡོད། །དེ་ན་ཁ་ཅིག་གིས་སྨྲས་པ།
en: Agnidatta, who had once trusted the brahmins and the householders in Rājagṛha but again began to quarrel with them, visited the residences of non-Buddhist ascetics and the forests of ascetics here and there and asked them, “Sirs, is there any means to attain all that I want and seek?”

source: མེར་ཞུགས་ཤིག །ཁ་ཅིག་གིས་སྨྲས་པ།
en: On those occasions, one said, “Enter into a fire”;

source: དུག་ཟོ་ཤིག །ཁ་ཅིག་གིས་སྨྲས་པ།
en: another one said, “Take poison”;

source: གཡང་ས་ནས་བདག་ཉིད་མཆོངས་ཤིག །ཁ་ཅིག་གིས་སྨྲས་པ།
en: another one said, “Throw yourself from a cliff”;

source: བདག་རང་གི་སྐེ་ལ་ཐག་པ་ཐོགས་ཏེ་ཤིང་གི་ཡལ་ག་ལས་འཕྱང་དུ་ཆུག་ཤིག་ཅེས་ཐམས་ཅད་ཀྱིས་འཆི་བའི་ཐབས་བསྟན་གྱི།
en: and another one said, “Tie a rope around your neck and hang yourself from the bough of a tree.” All of them thus taught a means of death, not a means of going forth.

source: ངེས་པར་འབྱུང་བའི་ཐབས་ནི་མ་ཡིན་པས་དེ་རིམ་གྱིས་འོད་མའི་ཚལ་དུ་སོང་ངོ་། །དེས་དགེ་སློང་ཞིག་མཐོང་ནས་དྲིས་པ། འཕགས་པ་གང་གིས་གང་བསམས་པ་དང་། གང་དོན་དུ་གཉེར་བ་དེ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་བའི་ཐབས་ལྟ་འགའ་མཆིས་སམ། དེས་སྨྲས་པ།
en: He went to the Bamboo Grove and saw a monk and asked him, “Noble one, is there any means to attain all that I want and seek?”

source: བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་བྱུང་ཤིག །དེར་ཅི་ཞིག་བགྱི།
en: “Go forth in the presence of the Blessed One,” said the monk. “What will I do there?”

source: དེར་ཇི་སྲིད་འཚོའི་བར་དུ་ཚངས་པར་སྤྱོད་པ་ཡང་སྤྱད་པར་བྱ། བསམ་གཏན་དང་གདོན་པ་དང་ལྡན་པར་ཡང་གནས་པར་བྱ་སྟེ།
en: “You should, throughout your life, lead the pure life and be engaged in dhyāna and recitation.

source: གལ་ཏེ་རེ་ཞིག་མཐོང་བའི་ཆོས་ཉིད་ལ་ཀུན་ཤེས་པ་ཐོབ་ན། དེ་ནས་དེ་ཉིད་ཁྱོད་ཀྱི་སྡུག་བསྔལ་གྱི་མཐར་ཕྱིན་པ་ཡིན་ནོ།
en: If you attain omniscience in this present life, you will have arrived at the end of your suffering.

source: །འོན་ཏེ་སྦྱོར་བའི་ལྷག་མ་དང་བཅས་བཞིན་དུས་བྱེད་ན་གང་བསམས་པ་དང་། གང་དོན་དུ་གཉེར་བ་དེ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: On the other hand, should you die with your fetters remaining, you will attain all that you want and seek.”

source: །འཕགས་པ་དེ་ནི་རྔོ་མི་ཐོག་ན། གཞན་ཡང་ཅུང་ཟད་ཅི་མཆིས།
en: “Noble one, if I cannot do that, is there any other means?”

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲོངས་ལ་གདུགས་ཚོད་གསོལ་ཅིག །དེ་ཡང་རྔོ་མི་ཐོག་ན་གཞན་བསྟན་དུ་གསོལ།
en: “Invite the community of monks headed by the Buddha and offer a meal.” “Please tell me another way in case I cannot do that either.”

source: བུམ་པ་བཟང་པོ་ལྟ་བུའི་ཉན་ཐོས་ཆེན་པོ་བཞི་སྤྱན་དྲོངས་ལ་གདུགས་ཚོད་གསོལ་ཏེ་སྨོན་ལམ་ཐོབ་ཤིག་དང་གང་བསམས་པ་དང་། གང་དོན་དུ་གཉེར་བ་དེ་ཐམས་ཅད་འགྲུབ་བོ།
en: “Invite the four great disciples who are like a wish-fulfilling vase, offer them a meal, and make an aspiration, and you will attain all that you want and seek.” “Noble one, I can do that. I will.”

source: །འཕགས་པ་དེ་ནི་རྔོ་ཐོག་གིས་བགྱིའོ་ཞེས་དེས་བུམ་པ་བཟང་པོ་ལྟ་བུའི་ཉན་ཐོས་ཆེན་པོ་བཞི་སྤྱན་དྲངས་ཏེ། གདུགས་ཚོད་གསོལ་ནས་སྨོན་ལམ་བཏབ་པ།
en: He invited the four great disciples who are like a wish-fulfilling vase, offered them a meal, and made this aspiration:

source: དགེ་བའི་རྩ་བ་འདིས་རབ་མཛེས་ཀླུའི་གནས་ནས་བསད་ལ་བདག་དེར་སྐྱེ་ཞིང་དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ལ་གནོད་པ་བྱེད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: “May this root of merit cause Sundara to die and disappear from the state of a nāga and allow me be born there, and after that do harm to the people of Rājagṛha!”

source: །དེ་ལ་ཆུང་མས་དྲིས་པ། རྗེའི་སྲས་སྨོན་ལམ་ཇི་ཞིག་བཏབ།
en: His wife asked him, “My dear, what aspiration did you make?”

source: །ལེགས་ཏེ་བདག་ཀྱང་ཁྱོད་ཀྱི་ཆུང་མར་གྱུར་ཅིག །བུས་སྨྲས་པ་བདག་ཀྱང་ཁྱོད་ཀྱི་བུར་གྱུར་ཅིག །དེ་བཞིན་དུ་བུ་མོས་སྨྲས་པ།
en: “Good. May I become your wife when you get your wish!” His son said, “May I become your son, too!”

source: བདག་ཀྱང་ཁྱོད་ཀྱི་བུ་མོར་གྱུར་ཅིག །དེ་བཞིན་དུ་མནའ་མས་སྨྲས་པ།
en: His daughter said likewise, “May I become your daughter, too!” And his son’s wife said likewise, “May I become your son’s wife, too!”

source: བདག་ཀྱང་མནའ་མར་གྱུར་ཅིག་ཅེས་བྱས་ནས་དེ་རྣམས་ཁྱིམ་རྙིང་པ་ཞིག་ཏུ་ཞུགས་ཏེ་ཉལ་བ་དང་སྤྲིན་ཁ་དོག་ལྔ་པ་ལས་ཆར་པ་བབ་སྟེ། རྩིག་པ་འགྱེལ་བས་ནོན་ཏེ་ཁ་དག་གོ།
en: When they entered an old house and slept, rain fell from a cloud of five colors, and they were all killed, crushed by a falling wall.

source: །ཀླུ་རབ་མཛེས་ཤི་འཕོས་ནས་འཁོར་ཀླུ་དྲུག་ཁྲི་དང་དེར་སྐྱེས་ནས་དེ་ཡང་རབ་མཛེས་ཞེས་བྱ་བར་གྲགས་སོ།
en: After the nāga Sundara had died, they were born there with sixty thousand attendant nāgas. The nāga who had been Agnidatta in his former life then became known as Sundara, too.

source: །ཆུང་མ་ནི་འཁོར་བྲལ་ཞེས་བྱའོ། །བུ་ནི་རི་བོ་ཅན་ཞེས་བྱའོ། །བུ་མོ་ནི་སེར་བ་ཞེས་བྱའོ། །མནའ་མ་ནི་གློག་ཅེས་བྱའོ།
en: His wife’s name became Free from the Cycle, his son’s name Mountain, his daughter’s name Hail, and his son’s wife’s name Lightning.

source: །ཆོས་ཉིད་ཀྱིས་ཀླུའམ་ཀླུའི་བུ་མོ་སྐྱེས་ནས་རིང་པོ་མ་ལོན་པར་གསུམ་དྲན་པར་འགྱུར་ཏེ།
en: It is natural that male nāgas and female nāgas remember three things just after birth:

source: གང་ནས་ཤི་འཕོས་པ་དང་། གང་དུ་སྐྱེས་པ་དང་། ལས་གང་གིས་ཡིན་པའོ།
en: where they died, where they were reborn, and by what action.

source: །དེས་བལྟས་ན་མི་ལས་ཤི་འཕོས་སོ།
en: The nāga observed that he had died in the human world.

source: །གང་དུ་སྐྱེས་ཤེ་ན།
en: Where was he born?

source: ཀླུ་རྣམས་སུའོ།
en: In the midst of nāgas.

source: །ལས་གང་གིས་ཤེ་ན།
en: By what karma?

source: སྨོན་ལམ་གྱི་དབང་གིས་སོ།
en: By the force of an aspiration.

source: །ཅིའི་ཕྱིར་སྙམ་ན།
en: For what purpose?

source: རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ལ་གནོད་པར་བྱ་བའི་ཕྱིར་རོ། །དེས་བསམས་པ།
en: For the purpose of doing harm to the people in Rājagṛha.

source: ཅི་ལོ་ཏོག་ཅི་ལྟ་བ་བཞིན་དུ་སྐྱེས་པ་ལ་བྱས་ན་མི་རྣམས་ཀྱི་སྡུག་བསྔལ་སྐྱེ་བར་འགྱུར་རམ། འོན་ཏེ་མ་སྐྱེས་པ་རྣམས་ལ་འགྱུར་སྙམ་ན། དེས་ཇི་ལྟར་སྐྱེས་པ་ལ་བྱས་པ་ལྟར་མ་སྐྱེས་པ་ལ་ནི་དེ་ལྟ་མ་ཡིན་པར་མཐོང་ནས།
en: He asked himself, “Which causes greater suffering to people, doing harm to crops that have just sprung up, or to crops that have not yet sprung up?” He saw that doing harm to crops that have not yet sprung up would do less damage than doing harm to crops that have just sprung up.

source: དེས་འཁོར་རྣམས་ལ་བསྒོ་བ་ཤེས་ལྡན་དག་ཚུར་ཤེག །ཡུལ་མ་ག་དྷཱར་དེང་ལ་ཆར་པས་ལོ་ཏོག་ཐམས་ཅད་བསྐྲུན་ཅིག །དེ་རྣམས་ཀྱིས་ལོ་ཏོག་ཐམས་ཅད་བསྐྲུན་པ་དང་། དེ་ནས་དྲུག་སྟོང་གི་འཁོར་དང་གཤོལ་མདའ་ཙམ་གྱི་ཆར་གྱི་རྒྱུན་གྱིས་ཇི་ལྟར་ཡུལ་མ་ག་དྷཱར་སོག་མ་ཡང་ཁྱེར་བ་དེ་ལྟ་བུའི་ཆར་གྱི་རྒྱུན་དབབ་པར་བརྩམས་སོ།
en: He ordered his attendants, “Sirs, now cause all the crops in the country of Magadha to grow with rain today.” They caused all the crops to grow. Then he, with his sixty thousand attendants, caused rain as thick as the shafts of a plough, which looked as if it would carry away everything down to the last straw.

source: །དེ་ནས་དེ་དག་ཕན་ཚུན་དུ་སྨྲས་པ། སོག་མ་ཡང་ཀླུ་འདིས་ཕྲོགས་སོ་ཞེས་དེའི་མིང་སོག་མ་མེད་ཅེས་བྱ་བར་ཐོགས་སོ།། །།སྡོམ་ལ།
en: Because of this, the people said to each other, “This nāga carried away even the straw.” The nāga’s name thus became Apalāla (Without a Straw). Chapter Three Summary of Contents:

source: རྒྱལ་པོའི་ཁབ་དང་ན་ལན་ད།
en: Rājagṛha, Nālandā,

source: །འོད་མའི་དབྱུག་པ་དམར་བུའི་གྲོང་།
en: Veṇuyaṣṭikā, Pāṭali Village,

source: །ཆུ་བོ་གང་གཱ་སྤྲིན་བརྩེགས་དང་། །སྒྲ་ཆེན་ཡངས་པ་ཐ་མ་ཡིན།
en: The Ganges, Massed Cloud, Mahāpraṇāda, and Vaiśālī, which is the last. I. Rājagṛha A.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ན་བཞུགས་སོ།
en: The Disaster of Rājagṛha and Its End The Buddha, the Blessed One, was once staying in Kalandaka­nivāpa Bamboo Grove near Rājagṛha.

source: །གང་གི་ཚེ་གཞོན་ནུ་མ་སྐྱེས་དགྲ་ལྷ་སྦྱིན་གྱིས་སྦད་ནས་ཕ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་བསད་དེ་རང་ཉིད་ཀྱིས་ཅོད་པན་བཅིངས་ནས་རྒྱལ་པོར་ཞུགས་པ་དེའི་ཚེ་དེ་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་མ་ཡིན་པ་མང་པོ་བྱ་བར་བརྩམས་ཏེ། དགྲོངས་པ་མན་ཆད་བྱ་བའི་ཕྱིར་གླང་པོ་ཆེ་ནོར་སྐྱོང་དང་ཁྱི་གཏུམ་པོ་ཟ་བ་དག་སྦད་པ་དང་། དེའི་མ་ལུས་འཕགས་མས་སྨྲས་པ།
en: When Prince Ajātaśatru was enticed by Devadatta to kill his own father, who was a righteous Dharma king, and crown himself king, he began to perform a number of disrespectful acts toward the Blessed One and set the elephant Dhanapālaka and a fierce dog on the Blessed One in order to kill him. His mother, Vaidehī, told him, “My son, do not perform disrespectful acts toward the Blessed One.

source: བུ་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་མ་ཡིན་པ་མ་བྱེད་ཅིག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བཀུར་སྟི་མ་ཡིན་པས་བསྙེངས་པ་ཡིན་གྱིས། རྒྱལ་པོའི་ཁབ་ནས་བཞུད་དེ་གནོད་པར་གྱུར་ཏ་རེ།
en: Since the buddhas, the blessed ones, are concerned about disrespectful acts, the Blessed One will leave Rājagṛha, which is bound to be a loss for us.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཡུལ་ཨང་ག་དང་། མ་ག་དྷཱ་རྣམས་འབྱོར་ཅིང་ཉམས་དགའ་བ་ཡིན་ནོ། །སྙིང་རྙོག་པ་ཅན་དེས་སྨྲས་པ།
en: Thanks to the Blessed One’s power, the people of the countries of Aṅga and Magadha have been rich and enjoyed themselves.”

source: ཅི་གང་ན་བཅོམ་ལྡན་འདས་མེད་པའི་ཡུལ་དེ་དག་ཞིག་པ་དང་སྟོངས་པར་གྱུར་ཏམ། དེ་མས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་བཟློག་ཀྱང་མ་བཏུབ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: In an agitated state of mind, he replied, “Will a country where the Blessed One is not staying become ruined and uninhabited?” All his mother’s attempts to stop him were in vain.

source: གཞོན་ནུ་མ་སྐྱེས་དགྲ་འདི་བསོད་ནམས་མ་ཡིན་པ་མང་དུ་སོགས་ཀྱིས་ངས་འདི་གཞི་མེད་པའི་དད་པ་ལ་གཞག་ཏུ་རེ་ཞིག་དེའི་དུས་ལ་མ་བབ་པས་མཉན་ཡོད་དུ་གཤེགས་སོ་སྙམ་ནས། དེ་ནས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་མཉན་ཡོད་གང་ན་བ་དེར་རྒྱུ་ཞིང་གཤེགས་ཏེ་རིམ་གྱིས་རྒྱུ་ཞིང་གཤེགས་པ་ན་མཉན་ཡོད་དུ་བྱོན་ནས།
en: The Blessed One thought, “Since this Prince Ajātaśatru has performed a number of nonmeritorious acts, now is not a good time for me to establish him in rootless faith. Therefore I shall go to Śrāvastī.” Thereupon the Blessed One, with the community of disciples, traveled toward Śrāvastī.

source: མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་བཞུགས་སོ།
en: In due course, he arrived in Śrāvastī and stayed in the Jetavana, in the Park of Anāthapiṇḍada near Śrāvastī.

source: །མཐའི་རྒྱལ་ཕྲན་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མ་སྐྱེས་དགྲས་བཀུར་སྟི་མ་ཡིན་པ་བྱས་པས་དེ་བཀུར་སྟི་མ་ཡིན་པས་བསྙེངས་ནས་རྒྱལ་པོའི་ཁབ་ནས་གཤེགས་ཏེ་མཉན་ཡོད་དུ་བྱོན་ཏོ་ཞེས་ཐོས་ནས།
en: Neighboring minor kings heard that since Ajātaśatru had performed disrespectful acts toward the Blessed One, the Blessed One had become concerned about such disrespectful acts, left Rājagṛha, and arrived in Śrāvastī.
